<a href="https://colab.research.google.com/github/19PA1A05B4/VITBML-EDA1/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
data=pd.read_csv('https://raw.githubusercontent.com/bhargav23/Dataset/master/Toyota.csv'
)

In [9]:
data.columns

Index(['Unnamed: 0', 'Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor',
       'Automatic', 'CC', 'Doors', 'Weight'],
      dtype='object')

In [10]:
data.head()

   Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0           0  13500  23.0  46986  ...         0  2000  three    1165
1           1  13750  23.0  72937  ...         0  2000      3    1165
2           2  13950  24.0  41711  ...         0  2000      3    1165
3           3  14950  26.0  48000  ...         0  2000      3    1165
4           4  13750  30.0  38500  ...         0  2000      3    1170

[5 rows x 11 columns]

In [12]:
data[["Age","Price"]].head(10)

    Age  Price
0  23.0  13500
1  23.0  13750
2  24.0  13950
3  26.0  14950
4  30.0  13750
5  32.0  12950
6  27.0  16900
7  30.0  18600
8  27.0  21500
9  23.0  12950

In [0]:
x=np.array(data['Age'])
y=np.array(data['Price'])

In [0]:
x_train,x_test,y_train,y_test=train_test_split(x,ytest_size=0.2,random_state=0)